       IDENTIFICATION DIVISION.                                     
       PROGRAM-ID. HELLO.                                            
      **
       ENVIRONMENT DIVISION.
      ** 
       DATA DIVISION.
      **
       PROCEDURE DIVISION.                                          
           DISPLAY 'HELLO WORLD'.                                   
           STOP RUN.                                               