//VSCODE JOB 'VSCODE: BUILD AND RUN COBOL',
// MSGCLASS=A,MSGLEVEL=(1,1),REGION=8M,CLASS=A
//VSCOMP  EXEC COBUCG,
// PARM.COB='FLAGW,LOAD,SIZE=2048K,BUF=1024K'
//COB.SYSPUNCH  DD  DUMMY
//COB.SYSIN     DD  DSN=HERC02.VSCODE.C01HELLO.WORLD,
// DISP=SHR
//COB.SYSLIB    DD  DSNAME=SYS1.COBLIB,
// DISP=SHR
//GO.SYSOUT     DD  SYSOUT=*,DCB=(RECFM=FBA,LRECL=161,BLKSIZE=16100)
//*******************************************************