      * ----------------------------------------------------------------
      * The motto of GnuCobol programmers. 
      * Yes, it's compilable.
      * ----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. motto.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

           1, computer                                               . 2
           programming value is "Highly rewarding".


           2, GnuCOBOL REDEFINES programming                     pic xx.
                                                               procedure
                                                               division.
           3. display GnuCOBOL.
