       01  struct-row.
           02  var-lp          PIC 9(2) VALUE 00.
           02  filler          PIC x VALUE "|".
           02  var-number      PIC z(10) VALUE 0.
           02  filler          PIC x VALUE "|".
           02  var-decimal     PIC +z(7).zz VALUE -317.21.
           02  filler          PIC x VALUE "|".
           02  var-currency    PIC $z(7).zz VALUE 317.21.